In [1]:
import pandas as pd
import numpy as np

In [11]:
data = pd.read_csv("datasets/raw_data.csv")

In [3]:
df = pd.DataFrame(data)

In [4]:
df['tax_amount'] = df['income'].apply(lambda x: 0.2*x if x>=50000 else 0.1*x)

In [5]:
df

    id          name   age country   gender   income  tax_amount
0    1      John Doe  29.0     USA     Male  55000.0     11000.0
1    1      John Doe  29.0     USA     Male  55000.0     11000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0     12400.0
3    3          Alex   NaN     USA  Unknown  47000.0      4700.0
4    4  Maria Garcia  34.0   Spain   Female      NaN         NaN
5    5        Li Wei  27.0   China     Male  51000.0     10200.0
6    6           NaN  45.0   India   Female  73000.0     14600.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0     13600.0
8    8    Rachel Lee  29.0     USA   Female  62000.0     12400.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0      4500.0
10  10   Emily Davis  31.0     USA      NaN  58000.0     11600.0

In [6]:
df['tax_Vectorized'] = np.where(df['income']>=50000,df['income']*0.2,df['income']*0.1)

In [7]:
df

,id,name,age,country,gender,income,tax_amount,tax_Vectorized
0,1,John Doe,29.0,USA,Male,55000.0,11000.0,11000.0
1,1,John Doe,29.0,USA,Male,55000.0,11000.0,11000.0
2,2,Jane Smith,NaN,Canada,Female,62000.0,12400.0,12400.0
3,3,Alex,NaN,USA,Unknown,47000.0,4700.0,4700.0
4,4,Maria Garcia,34.0,Spain,Female,NaN,NaN,NaN
5,5,Li Wei,27.0,China,Male,51000.0,10200.0,10200.0
6,6,NaN,45.0,India,Female,73000.0,14600.0,14600.0
7,7,Ahmed Khan,38.0,NaN,Male,68000.0,13600.0,13600.0
8,8,Rachel Lee,29.0,USA,Female,62000.0,12400.0,12400.0
9,9,Carlos Ruiz,NaN,Mexico,Male,45000.0,4500.0,4500.0
10,10,Emily Davis,31.0,USA,NaN,58000.0,11600.0,11600.0

In [8]:
df.duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [9]:
values = df['income'].apply(lambda x: x*0.2)

In [10]:
type(values)

pandas.core.series.Series